# Лабораторная работа. Доступ к сетевым устройствам по протоколу SSH
## Топология
![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/topology.png)
## Таблица адресации

| Устройство    | Интерфейс          | IP-адрес     | Маска подсети | Шлюз по умолчанию |
| ------------- |:------------------:| ------------:|:-------------:|:-----------------:|
| R1            | G0/0/1             | 192.168.1.1  | 255.255.255.0 | -                 |
| S1            | VLAN 1             | 192.168.1.11 | 255.255.255.0 | 192.168.1.1       |
| PC A          | NIC                | 192.168.1.3  | 255.255.255.0 | 192.168.1.1       |


## Задачи
### Часть 1. Настройка основных параметров устройства
### Часть 2. Настройка маршрутизатора для доступа по протоколу SSH
### Часть 3. Настройка коммутатора для доступа по протоколу SSH
### Часть 4. SSH через интерфейс командной строки (CLI) коммутатора


## Общие сведения/сценарий

   Раньше для удаленной настройки сетевых устройств в основном применялся протокол Telnet. Однако он не обеспечивает шифрование информации, передаваемой между клиентом и сервером, что позволяет анализаторам сетевых пакетов перехватывать пароли и данные конфигурации.

   Secure Shell (SSH) — это сетевой протокол, устанавливающий безопасное подключение с эмуляцией терминала к маршрутизатору или иному сетевому устройству. Протокол SSH шифрует все сведения, которые поступают по сетевому каналу, и предусматривает аутентификацию удаленного компьютера. Протокол SSH все больше заменяет Telnet — именно его выбирают сетевые специалисты в качестве средства удаленного входа в систему. SSH чаще всего используется для входа на удаленное устройство и выполнения команд. Но это может также передавать файлы по связанным протоколам SFTP или SCP.

   Чтобы протокол SSH мог работать, на сетевых устройствах, взаимодействующих между собой, должна быть настроена поддержка SSH. В этой лабораторной работе необходимо включить SSH-сервер на маршрутизаторе, после чего подключиться к этому маршрутизатору, используя ПК с установленным клиентом SSH. В локальной сети подключение обычно устанавливается с помощью Ethernet и IP.

   **Примечание**: Маршрутизаторы, используемые в практических лабораторных работах CCNA, - это Cisco 4221 с Cisco IOS XE Release 16.9.4 (образ universalk9). В лабораторных работах используются коммутаторы Cisco Catalyst 2960 с Cisco IOS версии 15.2(2) (образ lanbasek9). Можно использовать другие маршрутизаторы, коммутаторы и версии Cisco IOS. В зависимости от модели устройства и версии Cisco IOS доступные команды и результаты их выполнения могут отличаться от тех, которые показаны в лабораторных работах. Правильные идентификаторы интерфейса см. в сводной таблице по интерфейсам маршрутизаторов в конце лабораторной работы.

   **Примечание**: Убедитесь, что у всех маршрутизаторов и коммутаторов была удалена начальная конфигурация. Если вы не уверены, обратитесь к инструктору.

## Необходимые ресурсы
  * 1 Маршрутизатор (Cisco 4221 с универсальным образом Cisco IOS XE версии 16.9.4 или аналогичным)
  * 1 коммутатор (Cisco 2960 с ПО Cisco IOS версии 15.2(2) с образом lanbasek9 или аналогичная модель)
  * 1 ПК (под управлением Windows с программой эмуляции терминала, например, Tera Term)
  * Консольные кабели для настройки устройств Cisco IOS через консольные порты.
  * Кабели Ethernet, расположенные в соответствии с топологией

## Инструкции

## Часть 1. Настройка основных параметров устройств

   В части 1 потребуется настроить топологию сети и основные параметры, такие как IP-адреса интерфейсов, доступ к устройствам и пароли на маршрутизаторе.

### Шаг 1. Создайте сеть согласно топологии.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/my_topology.png)

   Назначьте имя хоста и настройте основные параметры устройства.

### Шаг 2. Выполните инициализацию и перезагрузку маршрутизатора и коммутатора.

```
Router>enable 
Router#erase startup-config 
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
%SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
Router#reload
Router>enable 
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#^Z
R1#
%SYS-5-CONFIG_I: Configured from console by console
wr mem
Building configuration...
[OK]
R1#
```

```
Switch>enable
Switch#show flash: 
Directory of flash:/

    1  -rw-     4670455          <no date>  2960-lanbasek9-mz.150-2.SE4.bin

64016384 bytes total (59345929 bytes free)
Switch#erase startup-config 
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]y[OK]
Erase of nvram: complete
%SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
Switch#reload
Switch>enable 
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#^Z
%SYS-5-CONFIG_I: Configured from console by console
SW1#wr mem
Building configuration...
[OK]
SW1#
```

### Шаг 3. Настройте маршрутизатор.

   a. Подключитесь к маршрутизатору с помощью консоли и активируйте привилегированный режим EXEC.

   b. Войдите в режим конфигурации.

   c. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.

   d. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.

   e. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.

   f. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.

   g. Зашифруйте открытые пароли.

   h. Создайте баннер, который предупреждает о запрете несанкционированного доступа.

   i. Настройте и активируйте на маршрутизаторе интерфейс G0/0/1, используя информацию, приведенную в таблице адресации.

   j. Сохраните текущую конфигурацию в файл загрузочной конфигурации.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/coslole_access.png)

### Шаг 4. Настройте компьютер PC-A.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/pc_ip_add.png)

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/pc_gateway_add.png)

### Шаг 5. Проверьте подключение к сети.

   Пошлите с PC-A команду Ping на маршрутизатор R1. Если эхо-запрос с помощью команды ping не проходит, найдите и устраните неполадки подключения.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/pc_ping_gateway.png)

## Часть 2. Настройка маршрутизатора для доступа по протоколу SSH

   Подключение к сетевым устройствам по протоколу Telnet сопряжено с риском для безопасности, поскольку вся информация передается в виде открытого текста. Протокол SSH шифрует данные сеанса и обеспечивает аутентификацию устройств, поэтому для удаленных подключений рекомендуется использовать именно этот протокол. В части 2 вам нужно настроить маршрутизатор для приема соединений SSH по линиям VTY.

### Шаг 1. Настройте аутентификацию устройств.

   При генерации ключа шифрования в качестве его части используются имя устройства и домен. Поэтому эти имена необходимо указать перед вводом команды **crypto key.**

   Откройте окно конфигурации

   a. Задайте имя устройства.

```
Router>enable 
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#
```

   b. Задайте домен для устройства.

```
R1(config)#ip domain-n
R1(config)#ip domain-name sshcon.com
```

### Шаг 2. Создайте ключ шифрования с указанием его длины.

```
R1(config)#crypto key generate rsa general-keys modulus 1024
The name for the keys will be: R1.sshcon.com

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
*Mar 1 0:4:30.87: %SSH-5-ENABLED: SSH 1.99 has been enabled
R1(config)#
```

### Шаг 3. Создайте имя пользователя в локальной базе учетных записей.

```
R1(config)#username admin password Adm1nP@55
R1(config)#
```
### Шаг 4. Активируйте протокол SSH на линиях VTY.

   a. Активируйте протоколы Telnet и SSH на входящих линиях VTY с помощью команды transport input.

```
R1(config-line)#transport input telnet
R1(config-line)#transport input ssh
```

   b. Измените способ входа в систему таким образом, чтобы использовалась проверка пользователей по локальной базе учетных записей.

```
R1(config-line)#login local
R1(config-line)#
```

### Шаг 5. Сохраните текущую конфигурацию в файл загрузочной конфигурации.

R1#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#

### Шаг 6. Установите соединение с маршрутизатором по протоколу SSH.

   a. Запустите Tera Term с PC-A.
   b. Установите SSH-подключение к R1. Use the username admin and password Adm1nP@55. У вас должно получиться установить SSH-подключение к R1.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/pc_ssh_to_R1.png)

## Часть 3. Настройка коммутатора для доступа по протоколу SSH

   В части 3 вам предстоит настроить коммутатор для приема подключений по протоколу SSH, а затем установить SSH-подключение с помощью программы Tera Term.

### Шаг 1. Настройте основные параметры коммутатора.

   a. Подключитесь к коммутатору с помощью консольного подключения и активируйте привилегированный режим EXEC.

   b. Войдите в режим конфигурации.

   c. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.

   d. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.

   e. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.

   f. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.

   g. Зашифруйте открытые пароли.

   h. Создайте баннер, который предупреждает о запрете несанкционированного доступа.

   i. Настройте и активируйте на коммутаторе интерфейс VLAN 1, используя информацию, приведенную в таблице адресации.

   j. Сохраните текущую конфигурацию в файл загрузочной конфигурации.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/sw_access.png)

### Шаг 2. Настройте коммутатор для соединения по протоколу SSH.

   Для настройки протокола SSH на коммутаторе используйте те же команды, которые применялись для аналогичной настройки маршрутизатора в части 2.

   a. Настройте имя устройства, как указано в таблице адресации.

   b. Задайте домен для устройства.

   c. Создайте ключ шифрования с указанием его длины.

   d. Создайте имя пользователя в локальной базе учетных записей.

   e. Активируйте протоколы Telnet и SSH на линиях VTY.

   f. Измените способ входа в систему таким образом, чтобы использовалась проверка пользователей по локальной базе учетных записей.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/sw_ssh.png)

### Шаг 3. Установите соединение с коммутатором по протоколу SSH.

   Запустите программу Tera Term на PC-A, затем установите подключение по протоколу SSH к интерфейсу SVI коммутатора S1.

   Вопрос:
   Удалось ли вам установить SSH-соединение с коммутатором?

```
Да
```

## Часть 4. Настройка протокола SSH с использованием интерфейса командной строки (CLI) коммутатора

   Клиент SSH встроен в операционную систему Cisco IOS и может запускаться из интерфейса командной строки. В части 4 вам предстоит установить соединение с маршрутизатором по протоколу SSH, используя интерфейс командной строки коммутатора.

### Шаг 1. Посмотрите доступные параметры для клиента SSH в Cisco IOS.

Используйте вопросительный знак (?), чтобы отобразить варианты параметров для команды ssh.

```
S1#ssh ?
  -l  Log in using this user name
  -v  Specify SSH Protocol Version
S1#ssh 
```

### Шаг 2. Установите с коммутатора S1 соединение с маршрутизатором R1 по протоколу SSH.

   a. Чтобы подключиться к маршрутизатору R1 по протоколу SSH, введите команду –l admin. Это позволит вам войти в систему под именем **admin.** При появлении приглашения введите в качестве пароля **Adm1nP@55**

```
S1#ssh -l admin 192.168.1.1

Password: 

unauthorized access prohibited

R1>
```

   b. Чтобы вернуться к коммутатору S1, не закрывая сеанс SSH с маршрутизатором R1, нажмите комбинацию клавиш Ctrl+Shift+6. Отпустите клавиши Ctrl+Shift+6 и нажмите x. Отображается приглашение привилегированного режима EXEC коммутатора.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/manipulations.png)

   c. Чтобы вернуться к сеансу SSH на R1, нажмите клавишу Enter в пустой строке интерфейса командной строки. Чтобы увидеть окно командной строки маршрутизатора, нажмите клавишу Enter еще раз.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/manipulations1.png)

   d. Чтобы завершить сеанс SSH на маршрутизаторе R1, введите в командной строке маршрутизатора команду exit.

![](https://github.com/pogodin2004/otusNetwork/blob/main/dz05/images/manipulations2.png)


   Какие версии протокола SSH поддерживаются при использовании интерфейса командной строки?

```
S1#sh ip ssh
SSH Enabled - version 1.99
Authentication timeout: 120 secs; Authentication retries: 3
```

## Вопрос для повторения

   Как предоставить доступ к сетевому устройству нескольким пользователям, у каждого из которых есть собственное имя пользователя?

```
   Если пользователи уже созданы, то подключение осущесталяется от его имени
   ssh -l <user> <ip-address>.
   Если пользователь не создан, то вводим команду
   username <username> secret <password>
   потом в line vty ... вводим login local
   и подключение осуществляем от имени выбранного пользователя.
```

